_posts/2016-12-11-Translate_Stackless_Scala_With_Free_Monads.org.html
---
layout: post
title: "Translate: Stackless Scala With Free Monads"
---

<div id="outline-container-org0eda3a3" class="outline-2">
<h2 id="org0eda3a3"><span class="section-number-2">1</span> Motivation</h2>
<div class="outline-text-2" id="text-1">
<p>
由于最近经常在生产中使用 <code>Free Monad</code> 范式, 所以就顺带看了看 <code>cats.Free</code> 的实现, 发现其实现方式和我想想中的 <code>Free</code> 不太一样, 除了 <code>Pure</code> (<code>Return</code>), <code>Suspend</code> 两种状态之外, 还有一个 <code>FlatMapped</code> 状态. 这样做看上去是为了将 <code>flatMap</code> 的 evaluation 延迟至 transform 期间完成, 但还是隐隐感觉和堆栈安全有关. 顺带想起关于 Scala FP 的堆栈安全一直是自己知识体系的一个空白, 因此就有了翻译 <code>Stackless Scala With Free Monads</code> 这篇论文的冲动, 期望这个工作能 drive 自己搞清楚 <b>Trampolining</b>.
</p>
</div>
</div>

<div id="outline-container-org0c4777f" class="outline-2">
<h2 id="org0c4777f"><span class="section-number-2">2</span> Stackless Scala With Free Monads</h2>
<div class="outline-text-2" id="text-2">
<p>
这篇论文是 Rúnar Bjarnason 在 2012 年的 Scala Days Conf 上发表并演讲的主题, 通过引入 Trampolining 范式(堆换栈, 感觉和 CPS 的理念很相似) 来解决 Scala 编译器无法完全尾调用优化的问题.
会议演讲视频: <a href="http://skillsmatter.com/podcast/scala/stackless-scala-free-monads">http://skillsmatter.com/podcast/scala/stackless-scala-free-monads</a>
论文原稿: <a href="http://days2012.scala-lang.org/sites/days2012/files/bjarnason_trampolines.pdf">http://days2012.scala-lang.org/sites/days2012/files/bjarnason_trampolines.pdf</a>
</p>
</div>
</div>

<div id="outline-container-org81aaf48" class="outline-2">
<h2 id="org81aaf48"><span class="section-number-2">3</span> Body 正文</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-org1800b66" class="outline-3">
<h3 id="org1800b66"><span class="section-number-3">3.1</span> Abstract 摘要</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Scala 编译器的尾调用优化 (Tail Call Elimination, TCE) 仅限于自递归方法 (Self-Recursive Methods) 而不是所有的尾调用. 这很容易使得那些由小函数组合而成的函数造成堆栈溢出. 拥有一个通用的尾调用优化方法非常有益于 Scala 语言, 尤其是有益于 Scala 的函数式编程. 针对那些本不支持尾调用优化的语言, Trampolining 是一个可以用于解决尾调用优化问题的常用方法. 本文引入 Trampolining 技术, 以将其推广为一个对任何方法调用(甚至是非尾部调用)的优化技术. 该技术能够完全的消除 Scala 程序对调用堆栈的使用.
</p>
</div>
</div>

<div id="outline-container-org766ed74" class="outline-3">
<h3 id="org766ed74"><span class="section-number-3">3.2</span> Introduction 介绍</h3>
<div class="outline-text-3" id="text-3-2">
<p>
调用堆栈是虚拟机的有限资源, 稍微有点经验的 Scala 程序员应该都遇见过一些看上去很正常的函数用尽了调用堆栈后使得程序崩溃并抛出 <code>StackOverflowError</code> 的错误.
考虑一个实用的例子, 在遍历一个 <code>List</code> 的同时维护一些状态. 我们采用 <code>State</code> 数据结构来表征一个简单的状态机的变换.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #d1f1a9;">case</span> <span style="color: #d1f1a9;">class</span> <span style="color: #bbdaff;">State</span>[<span style="color: #bbdaff;">S</span>, +<span style="color: #bbdaff;">A</span>](runS<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">S</span> <span style="color: #d1f1a9;">=&gt;</span> (<span style="color: #bbdaff;">A</span>, <span style="color: #bbdaff;">S</span>)) {
  <span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">map</span>[<span style="color: #bbdaff;">B</span>](f<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">A</span> <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">B</span>) <span style="color: #d1f1a9;">=</span> <span style="color: #bbdaff;">State</span>[<span style="color: #bbdaff;">S</span>, <span style="color: #bbdaff;">B</span>] { s <span style="color: #d1f1a9;">=&gt;</span> {
    <span style="color: #d1f1a9;">val</span> (<span style="color: #ffeead;">a</span>, <span style="color: #ffeead;">s1</span>) <span style="color: #d1f1a9;">=</span> runS(s)
    (f(a), s1)
  }}

  <span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">flatMap</span>[<span style="color: #bbdaff;">B</span>](f<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">A</span> <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">State</span>[<span style="color: #bbdaff;">S</span>, <span style="color: #bbdaff;">B</span>]) <span style="color: #d1f1a9;">=</span> <span style="color: #bbdaff;">State</span>[<span style="color: #bbdaff;">S</span>, <span style="color: #bbdaff;">B</span>] { s <span style="color: #d1f1a9;">=&gt;</span> {
    <span style="color: #d1f1a9;">val</span> (<span style="color: #ffeead;">a</span>, <span style="color: #ffeead;">s1</span>) <span style="color: #d1f1a9;">=</span> runS(s)
    f(a).runS(s1)
  }}
}
</pre>
</div>

<p>
函数 <code>runS</code> 以一个类型为 <code>S</code> 的状态作为输入, 返回一个类型为 <code>A</code> 的值以及一个新的状态. 而 <code>map</code> 和 <code>flatMap</code> 方法允许通过 for-comprehension 以一种命令式的代码方式将状态变换组合在一起, 如:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">getState</span>[<span style="color: #bbdaff;">S</span>]<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">State</span>[<span style="color: #bbdaff;">S</span>, <span style="color: #bbdaff;">S</span>] <span style="color: #d1f1a9;">=</span> <span style="color: #bbdaff;">State</span>(s <span style="color: #d1f1a9;">=&gt;</span> (s, s))

<span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">setState</span>[<span style="color: #bbdaff;">S</span>](s<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">S</span>)<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">State</span>[<span style="color: #bbdaff;">S</span>, <span style="color: #bbdaff;">Unit</span>] <span style="color: #d1f1a9;">=</span> <span style="color: #bbdaff;">State</span>(<span style="color: #d1f1a9;">_</span> <span style="color: #d1f1a9;">=&gt;</span> ((), s))

<span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">pureState</span>[<span style="color: #bbdaff;">S</span>, <span style="color: #bbdaff;">A</span>](a<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">A</span>)<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">State</span>[<span style="color: #bbdaff;">S</span>, <span style="color: #bbdaff;">A</span>] <span style="color: #d1f1a9;">=</span> <span style="color: #bbdaff;">State</span>(s <span style="color: #d1f1a9;">=&gt;</span> (a, s))
</pre>
</div>

<p>
注意到 <code>pureState</code> 和 <code>flatMap</code> 两个方法使得 <code>State</code> 成为一个 Monad.
</p>

<p>
作为一个简单的例子, 我们用 <code>State</code> 来实现对一个 <code>List</code> 中的元素编号. 这并不见得是 <code>State</code> 的一个常见用例, 仅仅因为这能够简单的诠释上文所说的堆栈溢出问题.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">zipIndex</span>[<span style="color: #bbdaff;">A</span>](as<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">List</span>[<span style="color: #bbdaff;">A</span>])<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">List</span>[(<span style="color: #bbdaff;">Int</span>, <span style="color: #bbdaff;">A</span>)] <span style="color: #d1f1a9;">=</span> as.foldLeft(pureState[<span style="color: #bbdaff;">Int</span>, <span style="color: #bbdaff;">List</span>[(<span style="color: #bbdaff;">Int</span>, <span style="color: #bbdaff;">A</span>)]](<span style="color: #bbdaff;">Nil</span>)) { (acc, a) <span style="color: #d1f1a9;">=&gt;</span>
  <span style="color: #d1f1a9;">for</span> {
    xs <span style="color: #d1f1a9;">&lt;-</span> acc
    n <span style="color: #d1f1a9;">&lt;-</span> getState[<span style="color: #bbdaff;">Int</span>]
    <span style="color: #d1f1a9;">_</span> <span style="color: #d1f1a9;">&lt;-</span> setState[<span style="color: #bbdaff;">Int</span>](n + <span style="color: #bbdaff;">1</span>)
  } <span style="color: #d1f1a9;">yield</span> (n, a) :: xs
}.runS(<span style="color: #bbdaff;">0</span>)._1.reverse
</pre>
</div>

<blockquote>
<p>
译者注: 对于 <code>State</code> 的 <code>flatMap</code> 方法, 每次调用都会在堆中产生一个新的 <code>State.class</code> 类型实例及其 <code>runS</code> 方法的函数类型 <code>State.1.class</code> 的实例. (<a href="http://blog.thegodcode.net/post/239967776/a-look-at-how-scala-compiles-to-java">A Look at How Scala Compiles to Java</a>)
</p>
</blockquote>

<p>
我们使用一个 <code>foldLeft</code> 来强调对 <code>list</code> 的遍历是一个尾递归的调用. 这个函数以一个空的 <code>list</code> 为起点, 不断在列表的头部添加元素, 所以与原 <code>list</code> 顺序相反. 而 <code>state</code> 是一个从零开始每步递增的整数, 所有的 <code>state</code> 的生成都发生在反转结果之前.
</p>

<p>
但是如果用一个元素数量超过虚拟机调用堆栈大小的 <code>list</code> 作为参数, <code>State.flatMap</code> 方法会抛出 <code>StackOverflowError</code> 的错误. 发生错误的原因是最终的 <code>state</code> 本质上是一个大函数, 由与 <code>list</code> 大小成正比的多个函数组合而成. 尽管它让我们觉得这是一个离散的一系列步骤, 但每个步骤使用了一种无法另编译器优化的方式去调用下一个步骤.
</p>

<p>
这种情况极大的限制了 Scala 的函数式编程特性. 而这篇论文就是来探讨解决方案的:
</p>
<ul class="org-ul">
<li>第三部分将探讨熟知的 Trampolining 技术. 在一个 Trampolined 的程序中, 我们不再让每个步骤直接去调用另一个步骤, 而采用一种 Trampoline 控制循环来暂缓下一步骤的发生. 这使得我们可以用堆去代替调用栈.</li>
<li>之后(在第四部分), 我们会将这种方法扩展为一个 Monad, 使得所有的调用都可以被转化为可依次消除的尾递归调用.</li>
<li>在实现这种 monad 时, 如果实现不当, 依然会导致在一些场景堆栈溢出的错误. 在 4.3 节, 我们将探讨这些场景以及如何消除这些问题.</li>
<li>Trampolined 程序可以是多层嵌套的来提供 cooperative coroutines, 我们将在第五部分探讨.</li>
<li>在第六部分, 我们将 Trampolines 推广为 Free Monad, 一种极为通用的递归数据结构. 通过分析操作这种结构的部分函数, 利用 Trampoline 的方法来解决 Free Monad 的堆栈问题.</li>
</ul>
</div>
</div>
