_posts/2016-12-11-Translate_Stackless_Scala_With_Free_Monads.org.html

<div id="outline-container-org4d35178" class="outline-3">
<h3 id="org4d35178"><span class="section-number-3">3.3</span> 背景: Scala 的尾调用优化</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Scala 的编译器能够对一种叫做自调用尾递归 (Self-recursive Call) 的代码进行优化. 例如, 下面实例代码中对 list 的 <b>左折</b> 操作可以被编译器优化为一个使用固定栈空间的函数:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">foldl</span>[<span style="color: #bbdaff;">A</span>, <span style="color: #bbdaff;">B</span>](as<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">List</span>[<span style="color: #bbdaff;">A</span>], b<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">B</span>, f<span style="color: #d1f1a9;">:</span> (<span style="color: #bbdaff;">B</span>, <span style="color: #bbdaff;">A</span>) <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">B</span>)<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">B</span> <span style="color: #d1f1a9;">=</span>
  as <span style="color: #d1f1a9;">match</span> {
    <span style="color: #d1f1a9;">case</span> <span style="color: #bbdaff;">Nil</span> <span style="color: #d1f1a9;">=&gt;</span> b
    <span style="color: #d1f1a9;">case</span> <span style="color: #ffeead;">x</span> <span style="color: #bbdaff;">::</span> <span style="color: #ffeead;">xs</span> <span style="color: #d1f1a9;">=&gt;</span> foldl(xs, f(b, x), f)
  }
</pre>
</div>

<p>
当编译器发现一个函数在尾部调用了自己, 并且 <b>该函数不能被重载 (例如, 使用 <code>private</code> 或 <code>final</code> 关键字声明)</b>, 则该函数的自调用会被编译替换为一个简单的跳转 (Jump). 这就相当于将该递归写成一个这循环:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">foldl</span>[<span style="color: #bbdaff;">A</span>, <span style="color: #bbdaff;">B</span>](as<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">List</span>[<span style="color: #bbdaff;">A</span>], b<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">B</span>, f<span style="color: #d1f1a9;">:</span> (<span style="color: #bbdaff;">B</span>, <span style="color: #bbdaff;">A</span>) <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">B</span>)<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">B</span> <span style="color: #d1f1a9;">=</span> {
  <span style="color: #d1f1a9;">var</span> <span style="color: #ff9da4; font-weight: bold;">z</span> <span style="color: #d1f1a9;">=</span> b
  <span style="color: #d1f1a9;">var</span> <span style="color: #ff9da4; font-weight: bold;">az</span> <span style="color: #d1f1a9;">=</span> as
  <span style="color: #d1f1a9;">while</span> (<span style="color: #bbdaff;">true</span>) {
    az <span style="color: #d1f1a9;">match</span> {
      <span style="color: #d1f1a9;">case</span> <span style="color: #bbdaff;">Nil</span> <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #d1f1a9;">return</span> z
      <span style="color: #d1f1a9;">case</span> <span style="color: #ffeead;">x</span> <span style="color: #bbdaff;">::</span> <span style="color: #ffeead;">xs</span> <span style="color: #d1f1a9;">=&gt;</span>
        z <span style="color: #d1f1a9;">=</span> f(b, x)
        az <span style="color: #d1f1a9;">=</span> xs
    }
  }
}
</pre>
</div>

<p>
除了跳转比方法调用更高效这个优势外, 这种优化使得无需使用任何调用栈.
但是,用跳转替换一个普通的尾调用就没有自递归调用优化那么简单了. 目前, JVM 只允许本地跳转, 所以根本没法从一个方法尾部直接跳转至另一个方法.例如, 一个相互跳转的递归是不能被编译器优化的, 即便它的调用在方法的尾部.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">even</span>[<span style="color: #bbdaff;">A</span>](ns<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">List</span>[<span style="color: #bbdaff;">A</span>])<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">Boolean</span> <span style="color: #d1f1a9;">=</span> ns <span style="color: #d1f1a9;">match</span> {
  <span style="color: #d1f1a9;">case</span> <span style="color: #bbdaff;">Nil</span> <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">true</span>
  <span style="color: #d1f1a9;">case</span> <span style="color: #ffeead;">x</span> <span style="color: #bbdaff;">::</span> <span style="color: #ffeead;">xs</span> <span style="color: #d1f1a9;">=&gt;</span> odd(xs)
}

<span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">odd</span>[<span style="color: #bbdaff;">A</span>](ns<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">List</span>[<span style="color: #bbdaff;">A</span>])<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">Boolean</span> <span style="color: #d1f1a9;">=</span> ns <span style="color: #d1f1a9;">match</span> {
  <span style="color: #d1f1a9;">case</span> <span style="color: #bbdaff;">Nil</span> <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">false</span>
  <span style="color: #d1f1a9;">case</span> <span style="color: #ffeead;">x</span> <span style="color: #bbdaff;">::</span> <span style="color: #ffeead;">xs</span> <span style="color: #d1f1a9;">=</span> even(xs)
}
</pre>
</div>

<p>
这两个方法会在参数长度大于堆栈长度时引发堆栈溢出.
</p>

<p>
尽管 JVM 很可能会在未来改进这点, 但也并不是一件容易的事, 并且有可能没有想象中那么有用. 比如说, JVM 的调用模型需要把每个线程的执行状态都保存在线程的调用堆栈里. 另外, 异常处理也是通过将异常压栈后将堆栈暴露给程序进行检查的. 事实上, JVM 的安全模型也是基于检查每个调用栈帧 (Stack Frame) 的权限来实现的. 而这又与子类, 动态分配策略,
即时编译器偶合在一起, 使得 Scala 编译器的尾调用优化难以实现.
</p>

<p>
不过还好, 我们可以回避所有这些问题, 通过一种简单的数据结构来用堆空间来代替栈空间.
</p>
</div>
</div>

<div id="outline-container-org532d2f1" class="outline-3">
<h3 id="org532d2f1"><span class="section-number-3">3.4</span> Trampolines: 以堆换栈</h3>
<div class="outline-text-3" id="text-3-4">
<p>
我们从一个非常简单的 Trampoline 数据类型来说明. 下例与 <code>scala.util.control.TailCalls.TailRec</code> 包中的 Trampoline 从原理上是完全相同的, 尽管实现的方式不同.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #ebbbff;">sealed</span> <span style="color: #d1f1a9;">trait</span> <span style="color: #bbdaff;">Trampoline</span>[+<span style="color: #bbdaff;">A</span>] {
  <span style="color: #ebbbff;">final</span> <span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">runT</span><span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">A</span> <span style="color: #d1f1a9;">=</span> <span style="color: #d1f1a9;">this</span> <span style="color: #d1f1a9;">match</span> {
    <span style="color: #d1f1a9;">case</span> <span style="color: #bbdaff;">More</span>(<span style="color: #ffeead;">k</span>) <span style="color: #d1f1a9;">=&gt;</span> k().runT
    <span style="color: #d1f1a9;">case</span> <span style="color: #bbdaff;">Done</span>(<span style="color: #ffeead;">v</span>) <span style="color: #d1f1a9;">=&gt;</span> v
  }
}

<span style="color: #d1f1a9;">case</span> <span style="color: #d1f1a9;">class</span> <span style="color: #bbdaff;">More</span>[+<span style="color: #bbdaff;">A</span>](k<span style="color: #d1f1a9;">:</span> () <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">Trampoline</span>[<span style="color: #bbdaff;">A</span>])
    <span style="color: #d1f1a9;">extends</span> <span style="color: #bbdaff;">Trampoline</span>[<span style="color: #bbdaff;">A</span>]

<span style="color: #d1f1a9;">case</span> <span style="color: #d1f1a9;">class</span> <span style="color: #bbdaff;">Done</span>[+<span style="color: #bbdaff;">A</span>](v<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">A</span>)
    <span style="color: #d1f1a9;">extends</span> <span style="color: #bbdaff;">Trampoline</span>[<span style="color: #bbdaff;">A</span>]
</pre>
</div>

<p>
Trampoline 将计算分解为多个步骤, 每个步骤可以有两种形式. <code>Done</code> 包含一个用于返回的值 <code>v</code>, 表示后续再无其他步骤. <code>More</code> 则包含一个生成后续步骤的函数 <code>k</code>. 而 <code>runT</code> 方法则是一个简单的尾递归, 用于执行所有的步骤. 它被定义为 <code>final</code> 以便让 Scala 编译器进行优化.
这就可以解决上文提到的互相跳转的尾调用递归问题. 我们只需要机械的将所有类型为 <code>T</code> 的返回值替换为 <code>Trampoline[T]</code> 就行了. 具体如下:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">even</span>[<span style="color: #bbdaff;">A</span>](ns<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">List</span>[<span style="color: #bbdaff;">A</span>])<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">Trampoline</span>[<span style="color: #bbdaff;">Boolean</span>] <span style="color: #d1f1a9;">=</span> ns <span style="color: #d1f1a9;">match</span> {
  <span style="color: #d1f1a9;">case</span> <span style="color: #bbdaff;">Nil</span> <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">Done</span>(<span style="color: #bbdaff;">true</span>)
  <span style="color: #d1f1a9;">case</span> <span style="color: #ffeead;">x</span> <span style="color: #bbdaff;">::</span> <span style="color: #ffeead;">xs</span> <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">More</span>(() <span style="color: #d1f1a9;">=&gt;</span> odd(xs))
}

<span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">odd</span>[<span style="color: #bbdaff;">A</span>](ns<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">List</span>[<span style="color: #bbdaff;">A</span>])<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">Trampoline</span>[<span style="color: #bbdaff;">Boolean</span>] <span style="color: #d1f1a9;">=</span> ns <span style="color: #d1f1a9;">match</span> {
  <span style="color: #d1f1a9;">case</span> <span style="color: #bbdaff;">Nil</span> <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">Done</span>(<span style="color: #bbdaff;">false</span>)
  <span style="color: #d1f1a9;">case</span> <span style="color: #ffeead;">x</span> <span style="color: #bbdaff;">::</span> <span style="color: #ffeead;">xs</span> <span style="color: #d1f1a9;">=</span> <span style="color: #bbdaff;">More</span>(() <span style="color: #d1f1a9;">=&gt;</span> even(xs))
}
</pre>
</div>

<p>
我们从原来的直接递归调用, 变成使其返回一个表示下一个步骤的 <code>Trampoline</code>, 然后可以通过调用可以被优化的方法 <code>runT</code> 来递归执行. 这样, 无论输入的 <code>List</code> 有多长, 上面的代码也不会再引发堆栈溢出.
</p>
</div>
</div>

<div id="outline-container-org19749c8" class="outline-3">
<h3 id="org19749c8"><span class="section-number-3">3.5</span> 把所有调用都变为尾调用</h3>
<div class="outline-text-3" id="text-3-5">
<p>
让我们看看如何使用 Trampoline 技术来解决论文一开始提出的 State 遍历 list 的 堆栈溢出问题. 首先, 我们需要改写 State 的行为来返回可供尾递归的 Trampoline 类型.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #d1f1a9;">case</span> <span style="color: #d1f1a9;">class</span> <span style="color: #bbdaff;">State</span>[<span style="color: #bbdaff;">S</span>, +<span style="color: #bbdaff;">A</span>](runS<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">S</span> <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">Trampoline</span>[(<span style="color: #bbdaff;">A</span>, <span style="color: #bbdaff;">S</span>)])
</pre>
</div>

<p>
我们现在该如何实现组合 State 的 flatMap 呢? 先试试这样:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">flatMap</span>[<span style="color: #bbdaff;">B</span>](f<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">A</span> <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">State</span>[<span style="color: #bbdaff;">S</span>, <span style="color: #bbdaff;">B</span>]) <span style="color: #d1f1a9;">=</span> <span style="color: #bbdaff;">State</span>[<span style="color: #bbdaff;">S</span>, <span style="color: #bbdaff;">B</span>] { s <span style="color: #d1f1a9;">=&gt;</span>
  <span style="color: #bbdaff;">More</span>[(<span style="color: #bbdaff;">S</span>, <span style="color: #bbdaff;">B</span>)] { () <span style="color: #d1f1a9;">=&gt;</span>
    <span style="color: #d1f1a9;">val</span> (<span style="color: #ffeead;">a</span>, <span style="color: #ffeead;">s1</span>) <span style="color: #d1f1a9;">=</span> runS(s).runT
    <span style="color: #bbdaff;">More</span>(() <span style="color: #d1f1a9;">=&gt;</span> f(a).runS(s1))
  }
}
</pre>
</div>

<p>
但这样写会很低效. 而且例一中的 <code>zipIndex</code> 仍然可能会堆栈溢出, 甚至对于更小的 list. 问题出在 <code>runT</code> 的调用没有出现在尾部, 所以它并不能被封装在 <code>Trampoline</code> 内部, 也不能用 Trampoline 来优化.
</p>
</div>
