_org/2016-12-11-Translate_Stackless_Scala_With_Free_Monads.org
*** 用一个 Trampoline Monad ?

现在我们要用一个 Monadic 的 ~Trampoline~ 来解决该问题。它已经有了 ~unit~ 操作^{1}，定义在构造函数中。因此，只需要定义 Monadic 的 ~bind~ 操作，也就是 ~flatMap~ 方法, 即可. 让我们直接给 ~Trampoline~ 添加一个 ~flatMap~ 方法，如此一来，就可以将 ~State.flatMap~ 改写为：

#+BEGIN_SRC scala
  def flatMap[B](f: A => State[S, B]) =
    State[S, B](s => More(() => runS(s) flatMap {
      case (a, s1) => More(() => f(a) runS s1)
    }))
#+END_SRC

#+BEGIN_QUOTE
.^{1} 对于任意类型 =A=, ~Monad~ =M= 的 ~unit~ 函数定义为 =A => M[A]=. 之所以叫做 ~unit~ 是因为它是 ~flatMap~ 操作的 ~幺元~.
#+END_QUOTE

这显然有所改进. 它把问题转移到 ~Trampoline~ 的 ~flatMap~ 方法中, 因此我们可以这样试着实现：

#+BEGIN_SRC scala
  def flatMap[B](f: A => Trampoline[B]) =
    More[B](() => f(runT))
#+END_SRC

但这不是我们想要的. ~runT~ 依然不在调用的尾部. 看来无论我们怎么实现 ~Trampoline~ 的 ~flatMap~, 都不可能不消耗额外的栈空间.

*** 正确的构建 Monad

解决该问题的方法是为 ~Trampoline~ 数据类型增加一个类型构造器，并将 ~flatMap~ 方法的调用改为对构造器的调用:

#+BEGIN_SRC scala
  case class FlatMap[A, +B](
    sub: Trampoline[A],
    k: A => Trampoline[B]) extends Trampoline[B]
#+END_SRC

~Trampoline~ 的这种形式可以看作是对子程序 ~sub~ 的调用，其结果会被传入 =continuation= ~k~.
这时候, ~Trampoline~ =trait= 的 ~runT~ 就需要考虑这个新的构造器. 为了简单说明, 让我们把执行下一步与执行所有步分开：

#+BEGIN_SRC scala
  final def resume: Either[() => Trampoline[A], A] = this match {
    case Done(v) => Right(v)
    case More(k) => Left(k)
    case FlatMap(a, f) => a match {
      case Done(v) => f(v).resume
      case More(k) => Left(() => FlatMap(k(), f))
      case FlatMap(b, g) => (FlatMap(b, (x: Any) => FlatMap(g(x), f)): Trampoline[A]).resume
    }
  }

  final def runT: A = resume match {
    case Right(a) => a
    case Left(k) => k().runT
  }
#+END_SRC

~resume~ 方法利用模式匹配来处理 ~Trampoline~, 或者返回一个结果(即 ~Right~), 或者返回一个 ~Function0~ 来表明下一步的操作(即 ~Left~).
这里处理 ~FlatMap~ 这种情况的方式微秒而重要. 如果子程序 ~a~ 是 ~Done~, 我们会直接执行 =continuation=. 如果其被包裹在 ~More~ 中, 我们向前执行一步(译者: 即执行 ~More~ 中的函数), 并对其执行 ~FlatMap~ 操作. 如果子程序包含另一个子程序, 也就是一个内嵌的左结合的 ~FlatMap~ 如下:

#+BEGIN_SRC scala
  FlatMap(FlatMap(b, g), f)
#+END_SRC

这一步非常关键, 我们需要保证不引入新的栈帧. 技巧是利用结合律将其变换到右边:
(译者: 注意 ~Trampoline~ =Monad= 满足结合律,
因此 ~(b FlatMap g) FlatMap f = b FlatMap (x => g(x) FlatMap f)~)

#+BEGIN_SRC scala
  FlatMap(b, x => FlatMap(g(x), f))
#+END_SRC

这样一来, 在下一个迭代时就会对 ~b~ 进行模式匹配, 这样就能够在尾部继续调用 ~resume~.
由于这次 ~resume~ 调用是在 ~FlatMap~ 上的, 我们必须显示的将当前的对象转换为 ~Trampoline~, 这样编译器才能明白这其实是一次尾递归调用^{2}. 不用担心, 我们会在 4.3 节去掉该转换.

同时需要注意的是, 内嵌的 ~FlatMap~ 构造器中丢失了一些类型信息. 在 ~FlatMap(FlatMap(b, g), f)~ 形式中, ~b~ 的类型无从得知, 所以只能在转换右结合时将其视为 ~Any~. 这其实非常安全, 因为左结合时的嵌套结构的类型是正确的.
p
通过结合律转换利用到了 =Monad= 的规则. ~Trampoline~ 是一个 =Monad=, 而 =Monad= 一定是满足结合律的. 因此, 右结合方式一定等价于左结合的.

#+BEGIN_QUOTE
译者注:
~Trampoline~ 的三个实例代表了不同的使用场景: ~Done~ 表明了下一步计算会取出其值, 用于递归中的返回. ~More~ 表明了下一步计算的递归特性, 一般用于递归调用. ~FlatMap~ 中包含两个值, 左侧的子程序表明了下一步计算的类型, 右侧的函数表明了在下一步计算后需要做的事, 因此可用于非尾递归的后续操作.
#+END_QUOTE

