_posts/2016-12-11-Translate_Stackless_Scala_With_Free_Monads.org.html

<div id="outline-container-orgd46c916" class="outline-4">
<h4 id="orgd46c916"><span class="section-number-4">3.5.1</span> 用一个 Trampoline Monad ?</h4>
<div class="outline-text-4" id="text-3-5-1">
<p>
现在我们要用一个 Monadic 的 <code>Trampoline</code> 来解决该问题。它已经有了 <code>unit</code> 操作<sup>1</sup>，定义在构造函数中。因此，只需要定义 Monadic 的 <code>bind</code> 操作，也就是 <code>flatMap</code> 方法, 即可. 让我们直接给 <code>Trampoline</code> 添加一个 <code>flatMap</code> 方法，如此一来，就可以将 <code>State.flatMap</code> 改写为：
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">flatMap</span>[<span style="color: #bbdaff;">B</span>](f<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">A</span> <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">State</span>[<span style="color: #bbdaff;">S</span>, <span style="color: #bbdaff;">B</span>]) <span style="color: #d1f1a9;">=</span>
  <span style="color: #bbdaff;">State</span>[<span style="color: #bbdaff;">S</span>, <span style="color: #bbdaff;">B</span>](s <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">More</span>(() <span style="color: #d1f1a9;">=&gt;</span> runS(s) flatMap {
    <span style="color: #d1f1a9;">case</span> (<span style="color: #ffeead;">a</span>, <span style="color: #ffeead;">s1</span>) <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">More</span>(() <span style="color: #d1f1a9;">=&gt;</span> f(a) runS s1)
  }))
</pre>
</div>

<blockquote>
<p>
.<sup>1</sup> 对于任意类型 <code>A</code>, <code>Monad</code> <code>M</code> 的 <code>unit</code> 函数定义为 <code>A =&gt; M[A]</code>. 之所以叫做 <code>unit</code> 是因为它是 <code>flatMap</code> 操作的 <code>幺元</code>.
</p>
</blockquote>

<p>
这显然有所改进. 它把问题转移到 <code>Trampoline</code> 的 <code>flatMap</code> 方法中, 因此我们可以这样试着实现：
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">flatMap</span>[<span style="color: #bbdaff;">B</span>](f<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">A</span> <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">Trampoline</span>[<span style="color: #bbdaff;">B</span>]) <span style="color: #d1f1a9;">=</span>
  <span style="color: #bbdaff;">More</span>[<span style="color: #bbdaff;">B</span>](() <span style="color: #d1f1a9;">=&gt;</span> f(runT))
</pre>
</div>

<p>
但这不是我们想要的. <code>runT</code> 依然不在调用的尾部. 看来无论我们怎么实现 <code>Trampoline</code> 的 <code>flatMap</code>, 都不可能不消耗额外的栈空间.
</p>
</div>
</div>

<div id="outline-container-org9bfa9f5" class="outline-4">
<h4 id="org9bfa9f5"><span class="section-number-4">3.5.2</span> 正确的构建 Monad</h4>
<div class="outline-text-4" id="text-3-5-2">
<p>
解决该问题的方法是为 <code>Trampoline</code> 数据类型增加一个类型构造器，并将 <code>flatMap</code> 方法的调用改为对构造器的调用:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #d1f1a9;">case</span> <span style="color: #d1f1a9;">class</span> <span style="color: #bbdaff;">FlatMap</span>[<span style="color: #bbdaff;">A</span>, +<span style="color: #bbdaff;">B</span>](
  sub<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">Trampoline</span>[<span style="color: #bbdaff;">A</span>],
  k<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">A</span> <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">Trampoline</span>[<span style="color: #bbdaff;">B</span>]) <span style="color: #d1f1a9;">extends</span> <span style="color: #bbdaff;">Trampoline</span>[<span style="color: #bbdaff;">B</span>]
</pre>
</div>

<p>
<code>Trampoline</code> 的这种形式可以看作是对子程序 <code>sub</code> 的调用，其结果会被传入 <code>continuation</code> <code>k</code>.
这时候, <code>Trampoline</code> <code>trait</code> 的 <code>runT</code> 就需要考虑这个新的构造器. 为了简单说明, 让我们把执行下一步与执行所有步分开：
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #ebbbff;">final</span> <span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">resume</span><span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">Either</span>[() <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">Trampoline</span>[<span style="color: #bbdaff;">A</span>], <span style="color: #bbdaff;">A</span>] <span style="color: #d1f1a9;">=</span> <span style="color: #d1f1a9;">this</span> <span style="color: #d1f1a9;">match</span> {
  <span style="color: #d1f1a9;">case</span> <span style="color: #bbdaff;">Done</span>(<span style="color: #ffeead;">v</span>) <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">Right</span>(v)
  <span style="color: #d1f1a9;">case</span> <span style="color: #bbdaff;">More</span>(<span style="color: #ffeead;">k</span>) <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">Left</span>(k)
  <span style="color: #d1f1a9;">case</span> <span style="color: #bbdaff;">FlatMap</span>(<span style="color: #ffeead;">a</span>, <span style="color: #ffeead;">f</span>) <span style="color: #d1f1a9;">=&gt;</span> a <span style="color: #d1f1a9;">match</span> {
    <span style="color: #d1f1a9;">case</span> <span style="color: #bbdaff;">Done</span>(<span style="color: #ffeead;">v</span>) <span style="color: #d1f1a9;">=&gt;</span> f(v).resume
    <span style="color: #d1f1a9;">case</span> <span style="color: #bbdaff;">More</span>(<span style="color: #ffeead;">k</span>) <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">Left</span>(() <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">FlatMap</span>(k(), f))
    <span style="color: #d1f1a9;">case</span> <span style="color: #bbdaff;">FlatMap</span>(<span style="color: #ffeead;">b</span>, <span style="color: #ffeead;">g</span>) <span style="color: #d1f1a9;">=&gt;</span> (<span style="color: #bbdaff;">FlatMap</span>(b, (x<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">Any</span>) <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">FlatMap</span>(g(x), f))<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">Trampoline</span>[<span style="color: #bbdaff;">A</span>]).resume
  }
}

<span style="color: #ebbbff;">final</span> <span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">runT</span><span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">A</span> <span style="color: #d1f1a9;">=</span> resume <span style="color: #d1f1a9;">match</span> {
  <span style="color: #d1f1a9;">case</span> <span style="color: #bbdaff;">Right</span>(<span style="color: #ffeead;">a</span>) <span style="color: #d1f1a9;">=&gt;</span> a
  <span style="color: #d1f1a9;">case</span> <span style="color: #bbdaff;">Left</span>(<span style="color: #ffeead;">k</span>) <span style="color: #d1f1a9;">=&gt;</span> k().runT
}
</pre>
</div>

<p>
<code>resume</code> 方法利用模式匹配来处理 <code>Trampoline</code>, 或者返回一个结果(即 <code>Right</code>), 或者返回一个 <code>Function0</code> 来表明下一步的操作(即 <code>Left</code>).
这里处理 <code>FlatMap</code> 这种情况的方式微秒而重要. 如果子程序 <code>a</code> 是 <code>Done</code>, 我们会直接执行 <code>continuation</code>. 如果其被包裹在 <code>More</code> 中, 我们向前执行一步(译者: 即执行 <code>More</code> 中的函数), 并对其执行 <code>FlatMap</code> 操作. 如果子程序包含另一个子程序, 也就是一个内嵌的左结合的 <code>FlatMap</code> 如下:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #bbdaff;">FlatMap</span>(<span style="color: #bbdaff;">FlatMap</span>(b, g), f)
</pre>
</div>

<p>
这一步非常关键, 我们需要保证不引入新的栈帧. 技巧是利用结合律将其变换到右边:
(译者: 注意 <code>Trampoline</code> <code>Monad</code> 满足结合律,
因此 <code>(b FlatMap g) FlatMap f = b FlatMap (x =&gt; g(x) FlatMap f)</code>)
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #bbdaff;">FlatMap</span>(b, x <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">FlatMap</span>(g(x), f))
</pre>
</div>

<p>
这样一来, 在下一个迭代时就会对 <code>b</code> 进行模式匹配, 这样就能够在尾部继续调用 <code>resume</code>.
由于这次 <code>resume</code> 调用是在 <code>FlatMap</code> 上的, 我们必须显示的将当前的对象转换为 <code>Trampoline</code>, 这样编译器才能明白这其实是一次尾递归调用<sup>2</sup>. 不用担心, 我们会在 4.3 节去掉该转换.
</p>

<p>
同时需要注意的是, 内嵌的 <code>FlatMap</code> 构造器中丢失了一些类型信息. 在 <code>FlatMap(FlatMap(b, g), f)</code> 形式中, <code>b</code> 的类型无从得知, 所以只能在转换右结合时将其视为 <code>Any</code>. 这其实非常安全, 因为左结合时的嵌套结构的类型是正确的.
p
通过结合律转换利用到了 <code>Monad</code> 的规则. <code>Trampoline</code> 是一个 <code>Monad</code>, 而 <code>Monad</code> 一定是满足结合律的. 因此, 右结合方式一定等价于左结合的.
</p>

<blockquote>
<p>
译者注:
<code>Trampoline</code> 的三个实例代表了不同的使用场景: <code>Done</code> 表明了下一步计算会取出其值, 用于递归中的返回. <code>More</code> 表明了下一步计算的递归特性, 一般用于递归调用. <code>FlatMap</code> 中包含两个值, 左侧的子程序表明了下一步计算的类型, 右侧的函数表明了在下一步计算后需要做的事, 因此可用于非尾递归的后续操作.
</p>
</blockquote>
</div>
</div>
