_org/2016-12-11-Translate_Stackless_Scala_With_Free_Monads.org
*** 一个易错的问题

这里还有一个边缘情况需要考虑. ~resume~ 函数依然有可能造成栈溢出. 倘若 ~FlatMap~ 左侧的堆叠层次高出了调用栈的高度, ~f(v)~ 的调用会导致 ~g(x)~ 调用, 然后会导致里层的函数调用, 等等. 这可以通过在一开始就禁止左结合的内嵌的构造来避免. 我们将 ~FlatMap~ 构造器变为 =private=, 并通过暴露 ~Trampoline~ 的 ~flatMap~ 方法来代替它, 这样就能总是用右结合的结构来改写:

#+BEGIN_SRC scala
  def flatMap[B](f: A => Trampoline[B]): Trampoline[B] = this match {
    case FlatMap(a, g) => FlatMap(a, (x: A) => g(a) flatMap f)
    case x => FlatMap(x, f)
  }
#+END_SRC

同时, 必须同时避免通过 ~resume~ 方法来构造这种结构, 我们可以将其中的 ~FlatMap~ 构造改为对 ~flatMap~ 的调用:

#+BEGIN_SRC scala
  case FlatMap(a, f) => a match {
    case Done(v) => f(v).resume
    case More(k) => Left(() => k() flatMap f)
    case FlatMap(b, g) =>
      b.flatMap((x: Any) => g(x) flatMap f).resume
  }
#+END_SRC

最终, 为了能够在 Scala 的 for-comprehension 表达式中使用 ~Trampoline~ monad, 只需要用 ~flatMap~ 定义一个 ~map~ 方法就行了:

#+BEGIN_SRC scala
  def map[B](f: A => B): Trampoline[B] =
    flatMap(a => Done(f(a)))
#+END_SRC

** 无栈 Scala

通过使用 ~Trampoline~ 化的 ~State~ monad, 对任何大小的输入 =list=, 现在运行之前看到的 ~zipIndex~ 方法不会在引发堆栈溢出的异常了.
这里介绍的 ~Trampoline~ 是 Scala 中清除栈帧的一种通用手段. 我们可以用它来重写任何程序而不再需要栈空间了. 考虑一个具有如下形式的程序:

#+BEGIN_SRC scala
  val x = f()
  val y = g(x)
  h(y)
#+END_SRC

可以非常轻松的这样重写:

#+BEGIN_SRC scala
  for {
    x <- f()
    y <- g(x)
    z <- h(y)
  } yield z
#+END_SRC

当然, 需要定义如下的隐式转换:

#+BEGIN_SRC scala
  implicit def step[A](a: => A): Trampoline[A] =
    More(() => Done(a))
#+END_SRC

唯一不太适合用 ~step~ 转换的是(非偶然地)自递归调用. 这非常容易察觉, 当这种情况, 我们可以显示的调用 ~More~ 构造器, 例如下面的计算第 =n= 个斐波那契数的递归函数:

#+BEGIN_SRC scala
  def fib(n: Int): Trampoline[Int] =
    if(n <= 1) Done(n) else for {
      x <- More(() => fib(n-1))
      y <- More(() => fib(n-2))
    } yield x + y
#+END_SRC

由于这种转换是完全机械化的, 可能有人会写一个编译器插件或者扩展 Scala 的编译期将所有程序转换成这样.

** 多任务

我们已经看到如何使用 ~flatMap~ 序列化的组合 ~Trampoline~. 但其实可以通过交叉计算来并行的组合它们:

#+BEGIN_SRC scala
  def zip[B](b: Trampoline[B]): Trampoline[(A, B)] =
    (this.resume, b.resume) match {
      case (Right(a), Right(B)) => Done((a, b))
      case (Left(a), Left(b)) =>
        More(() => a() zip b())
      case (Left(a), Right(b)) =>
        More(() => a() zip Done(b))
      case (Right(a), Left(b)) =>
        More(() => Done(a) zip b())
    }
#+END_SRC

为了验证, 我们引入控制台打印:

#+BEGIN_SRC scala
  val hello: Trampoline[Unit] = for {
    _ <- print("Hello, ")
    _ <- println("World!")
  } yield ()
#+END_SRC

将其与自身交错执行, 然后观察结果:

#+BEGIN_SRC scala
  (hello zip hello).runT
  // Hello, Hello, World!
  // World!
#+END_SRC

尽管这是单线程的并行计算, 但很容易扩展到多线程的分布式计算. 对于一组待执行的 =trampoline=, 任何不是 ~Done~ 的 ~resume~ 任务都可以在任何线程执行.

可以将其推广到一个完全对称的协同程序. 我们会在下一节讨论.

