_posts/2016-12-11-Translate_Stackless_Scala_With_Free_Monads.org.html

<div id="outline-container-orgc3c3b75" class="outline-4">
<h4 id="orgc3c3b75"><span class="section-number-4">3.5.3</span> 一个易错的问题</h4>
<div class="outline-text-4" id="text-3-5-3">
<p>
这里还有一个边缘情况需要考虑. <code>resume</code> 函数依然有可能造成栈溢出. 倘若 <code>FlatMap</code> 左侧的堆叠层次高出了调用栈的高度, <code>f(v)</code> 的调用会导致 <code>g(x)</code> 调用, 然后会导致里层的函数调用, 等等. 这可以通过在一开始就禁止左结合的内嵌的构造来避免. 我们将 <code>FlatMap</code> 构造器变为 <code>private</code>, 并通过暴露 <code>Trampoline</code> 的 <code>flatMap</code> 方法来代替它, 这样就能总是用右结合的结构来改写:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">flatMap</span>[<span style="color: #bbdaff;">B</span>](f<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">A</span> <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">Trampoline</span>[<span style="color: #bbdaff;">B</span>])<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">Trampoline</span>[<span style="color: #bbdaff;">B</span>] <span style="color: #d1f1a9;">=</span> <span style="color: #d1f1a9;">this</span> <span style="color: #d1f1a9;">match</span> {
  <span style="color: #d1f1a9;">case</span> <span style="color: #bbdaff;">FlatMap</span>(<span style="color: #ffeead;">a</span>, <span style="color: #ffeead;">g</span>) <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">FlatMap</span>(a, (x<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">A</span>) <span style="color: #d1f1a9;">=&gt;</span> g(a) flatMap f)
  <span style="color: #d1f1a9;">case</span> <span style="color: #ffeead;">x</span> <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">FlatMap</span>(x, f)
}
</pre>
</div>

<p>
同时, 必须同时避免通过 <code>resume</code> 方法来构造这种结构, 我们可以将其中的 <code>FlatMap</code> 构造改为对 <code>flatMap</code> 的调用:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #d1f1a9;">case</span> <span style="color: #bbdaff;">FlatMap</span>(<span style="color: #ffeead;">a</span>, <span style="color: #ffeead;">f</span>) <span style="color: #d1f1a9;">=&gt;</span> a <span style="color: #d1f1a9;">match</span> {
  <span style="color: #d1f1a9;">case</span> <span style="color: #bbdaff;">Done</span>(<span style="color: #ffeead;">v</span>) <span style="color: #d1f1a9;">=&gt;</span> f(v).resume
  <span style="color: #d1f1a9;">case</span> <span style="color: #bbdaff;">More</span>(<span style="color: #ffeead;">k</span>) <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">Left</span>(() <span style="color: #d1f1a9;">=&gt;</span> k() flatMap f)
  <span style="color: #d1f1a9;">case</span> <span style="color: #bbdaff;">FlatMap</span>(<span style="color: #ffeead;">b</span>, <span style="color: #ffeead;">g</span>) <span style="color: #d1f1a9;">=&gt;</span>
    b.flatMap((x<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">Any</span>) <span style="color: #d1f1a9;">=&gt;</span> g(x) flatMap f).resume
}
</pre>
</div>

<p>
最终, 为了能够在 Scala 的 for-comprehension 表达式中使用 <code>Trampoline</code> monad, 只需要用 <code>flatMap</code> 定义一个 <code>map</code> 方法就行了:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">map</span>[<span style="color: #bbdaff;">B</span>](f<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">A</span> <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">B</span>)<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">Trampoline</span>[<span style="color: #bbdaff;">B</span>] <span style="color: #d1f1a9;">=</span>
  flatMap(a <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">Done</span>(f(a)))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3d2b55b" class="outline-3">
<h3 id="org3d2b55b"><span class="section-number-3">3.6</span> 无栈 Scala</h3>
<div class="outline-text-3" id="text-3-6">
<p>
通过使用 <code>Trampoline</code> 化的 <code>State</code> monad, 对任何大小的输入 <code>list</code>, 现在运行之前看到的 <code>zipIndex</code> 方法不会在引发堆栈溢出的异常了.
这里介绍的 <code>Trampoline</code> 是 Scala 中清除栈帧的一种通用手段. 我们可以用它来重写任何程序而不再需要栈空间了. 考虑一个具有如下形式的程序:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #d1f1a9;">val</span> <span style="color: #ffeead;">x</span> <span style="color: #d1f1a9;">=</span> f()
<span style="color: #d1f1a9;">val</span> <span style="color: #ffeead;">y</span> <span style="color: #d1f1a9;">=</span> g(x)
h(y)
</pre>
</div>

<p>
可以非常轻松的这样重写:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #d1f1a9;">for</span> {
  x <span style="color: #d1f1a9;">&lt;-</span> f()
  y <span style="color: #d1f1a9;">&lt;-</span> g(x)
  z <span style="color: #d1f1a9;">&lt;-</span> h(y)
} <span style="color: #d1f1a9;">yield</span> z
</pre>
</div>

<p>
当然, 需要定义如下的隐式转换:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #ebbbff;">implicit</span> <span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">step</span>[<span style="color: #bbdaff;">A</span>](a<span style="color: #d1f1a9;">:</span> <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">A</span>)<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">Trampoline</span>[<span style="color: #bbdaff;">A</span>] <span style="color: #d1f1a9;">=</span>
  <span style="color: #bbdaff;">More</span>(() <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">Done</span>(a))
</pre>
</div>

<p>
唯一不太适合用 <code>step</code> 转换的是(非偶然地)自递归调用. 这非常容易察觉, 当这种情况, 我们可以显示的调用 <code>More</code> 构造器, 例如下面的计算第 <code>n</code> 个斐波那契数的递归函数:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">fib</span>(n<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">Int</span>)<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">Trampoline</span>[<span style="color: #bbdaff;">Int</span>] <span style="color: #d1f1a9;">=</span>
  <span style="color: #d1f1a9;">if</span>(n &lt;= <span style="color: #bbdaff;">1</span>) <span style="color: #bbdaff;">Done</span>(n) <span style="color: #d1f1a9;">else</span> <span style="color: #d1f1a9;">for</span> {
    x <span style="color: #d1f1a9;">&lt;-</span> <span style="color: #bbdaff;">More</span>(() <span style="color: #d1f1a9;">=&gt;</span> fib(n-1))
    y <span style="color: #d1f1a9;">&lt;-</span> <span style="color: #bbdaff;">More</span>(() <span style="color: #d1f1a9;">=&gt;</span> fib(n-2))
  } <span style="color: #d1f1a9;">yield</span> x + y
</pre>
</div>

<p>
由于这种转换是完全机械化的, 可能有人会写一个编译器插件或者扩展 Scala 的编译期将所有程序转换成这样.
</p>
</div>
</div>

<div id="outline-container-org198aa06" class="outline-3">
<h3 id="org198aa06"><span class="section-number-3">3.7</span> 多任务</h3>
<div class="outline-text-3" id="text-3-7">
<p>
我们已经看到如何使用 <code>flatMap</code> 序列化的组合 <code>Trampoline</code>. 但其实可以通过交叉计算来并行的组合它们:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">zip</span>[<span style="color: #bbdaff;">B</span>](b<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">Trampoline</span>[<span style="color: #bbdaff;">B</span>])<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">Trampoline</span>[(<span style="color: #bbdaff;">A</span>, <span style="color: #bbdaff;">B</span>)] <span style="color: #d1f1a9;">=</span>
  (<span style="color: #d1f1a9;">this</span>.resume, b.resume) <span style="color: #d1f1a9;">match</span> {
    <span style="color: #d1f1a9;">case</span> (<span style="color: #bbdaff;">Right</span>(<span style="color: #ffeead;">a</span>), <span style="color: #bbdaff;">Right</span>(<span style="color: #bbdaff;">B</span>)) <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">Done</span>((a, b))
    <span style="color: #d1f1a9;">case</span> (<span style="color: #bbdaff;">Left</span>(<span style="color: #ffeead;">a</span>), <span style="color: #bbdaff;">Left</span>(<span style="color: #ffeead;">b</span>)) <span style="color: #d1f1a9;">=&gt;</span>
      <span style="color: #bbdaff;">More</span>(() <span style="color: #d1f1a9;">=&gt;</span> a() zip b())
    <span style="color: #d1f1a9;">case</span> (<span style="color: #bbdaff;">Left</span>(<span style="color: #ffeead;">a</span>), <span style="color: #bbdaff;">Right</span>(<span style="color: #ffeead;">b</span>)) <span style="color: #d1f1a9;">=&gt;</span>
      <span style="color: #bbdaff;">More</span>(() <span style="color: #d1f1a9;">=&gt;</span> a() zip <span style="color: #bbdaff;">Done</span>(b))
    <span style="color: #d1f1a9;">case</span> (<span style="color: #bbdaff;">Right</span>(<span style="color: #ffeead;">a</span>), <span style="color: #bbdaff;">Left</span>(<span style="color: #ffeead;">b</span>)) <span style="color: #d1f1a9;">=&gt;</span>
      <span style="color: #bbdaff;">More</span>(() <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">Done</span>(a) zip b())
  }
</pre>
</div>

<p>
为了验证, 我们引入控制台打印:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #d1f1a9;">val</span> <span style="color: #ffeead;">hello</span><span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">Trampoline</span>[<span style="color: #bbdaff;">Unit</span>] <span style="color: #d1f1a9;">=</span> <span style="color: #d1f1a9;">for</span> {
  <span style="color: #d1f1a9;">_</span> <span style="color: #d1f1a9;">&lt;-</span> print(<span style="color: #99ffff;">"Hello, "</span>)
  <span style="color: #d1f1a9;">_</span> <span style="color: #d1f1a9;">&lt;-</span> println(<span style="color: #99ffff;">"World!"</span>)
} <span style="color: #d1f1a9;">yield</span> ()
</pre>
</div>

<p>
将其与自身交错执行, 然后观察结果:
</p>

<div class="org-src-container">
<pre class="src src-scala">(hello zip hello).runT
<span style="color: #7285b7; font-style: italic;">// </span><span style="color: #7285b7; font-style: italic;">Hello, Hello, World!</span>
<span style="color: #7285b7; font-style: italic;">// </span><span style="color: #7285b7; font-style: italic;">World!</span>
</pre>
</div>

<p>
尽管这是单线程的并行计算, 但很容易扩展到多线程的分布式计算. 对于一组待执行的 <code>trampoline</code>, 任何不是 <code>Done</code> 的 <code>resume</code> 任务都可以在任何线程执行.
</p>

<p>
可以将其推广到一个完全对称的协同程序. 我们会在下一节讨论.
</p>
</div>
</div>
