_org/2016-12-11-Translate_Stackless_Scala_With_Free_Monads.org
** Free Monads: Trampoline 的推广

我们可以将 ~Trampoline~ 看作事一个能通过 ~Function0~ 挂起并之后执行的协同程序. 那么它就不再是唯一一种有此性质的类型构造器了, 如果将该行为抽象, 我们就能获得如下的类型:

#+BEGIN_SRC scala
  sealed trait Free[S[+_], +A] {
    private case class FlatMap[S[+_], A, +B](
      a: Free[S, A],
      f: A => Free[S, B]) extends Free[S, B]
  }

  case class Done[S[+_], +A](a: A) extends Free[S, A]

  case class More[S[+_], +A](k: S[Free[S, A]]) extends Free[S, A]
#+END_SRC

#+BEGIN_QUOTE
译者注: S 是 Function0 的推广. S 具有能够挂起计算的能力.
#+END_QUOTE

那么, ~Trampoline~ 可以如下定义:

#+BEGIN_SRC scala
type Trampoline[+A] = Free[Function0, A]
#+END_SRC

就像 ~Done~ 和 ~FlatMap~ 数据构造器一样, ~Free[S, A]~ 是任意协变的 =Functor= S 的一种 Monad. 从范畴论角度来看, 它正是该 =Functor= 生成的 =Free Monad= [4].
S 必须是一个 =Functor= 即必须存在 Functor[S]^{3}:

#+BEGIN_SRC scala
  trait Functor[F[_]] {
    def map[A, B](m: F[A])(f: A => B): F[B]
  }
#+END_SRC

对 ~Function0~ 来说是显而易见的:

#+BEGIN_SRC scala
  implicit val f0Functor = new Functor[Function0] {
    def map[A, B](a: () => A)(f: A => B) = () => f(a())
  }
#+END_SRC

*** Free Monad 的函数

为证实 Free Monad 的功效, 我们需要将之前为 ~Trampoline~ 定义的函数进行推广. 例如, 以下是 ~resume~ 的推广:

#+BEGIN_SRC scala
  final def resume(implicit S: Functor[S]): Either[S[Free[S, A]], A] =
    this match {
      case Done(a) => Right(a)
      case More(k) => Left(k)
      case a FlatMap f => a match {
        case Done(a) => f(a).resume
        case More(k) => Left(S.map(k)(_ flatMap f))
        case b FlatMap g => b.flatMap((x: Any) => g(x) flatMap f).resume
      }
    }
#+END_SRC

注意到该定义与之前 ~Trampoline~ 的 ~resume~ 如出一辙. 有所不同的只是类型签名, 隐式的 ~Functor~ 参数, 以及我们将显式的 ~Function0~ 构造改为了 ~Functor~ 的 ~map~ 方法调用. 这也适用于其它函数, 如 ~zip~, ~map~, 和 ~flatMap~ [10]. 以下是 ~zip~ 的定义:

#+BEGIN_SRC scala
  def zip[B](b: Free[S, B])(implicit S: Functor[S]): Free[S, (A, B)] =
    (this.resume, b.resume) match {
      case (Right(a), Right(B)) => Done((a, b))
      case (Left(a), Left(b)) => More(S.map(a)(x => More(S.map(b)(y => x zip y))))
      case (Left(a), Right(b)) => More(S.map(a)(x => x zip Done(b))
      case (Right(a), Left(b)) => More(S.map(b)(y => Done(a) zip y)
    }
#+END_SRC

