_posts/2016-12-11-Translate_Stackless_Scala_With_Free_Monads.org.html

<div id="outline-container-org1617388" class="outline-3">
<h3 id="org1617388"><span class="section-number-3">3.8</span> Free Monads: Trampoline 的推广</h3>
<div class="outline-text-3" id="text-3-8">
<p>
我们可以将 <code>Trampoline</code> 看作事一个能通过 <code>Function0</code> 挂起并之后执行的协同程序. 那么它就不再是唯一一种有此性质的类型构造器了, 如果将该行为抽象, 我们就能获得如下的类型:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #ebbbff;">sealed</span> <span style="color: #d1f1a9;">trait</span> <span style="color: #bbdaff;">Free</span>[<span style="color: #bbdaff;">S</span>[+<span style="color: #d1f1a9;">_</span>], +<span style="color: #bbdaff;">A</span>] {
  <span style="color: #ebbbff;">private</span> <span style="color: #d1f1a9;">case</span> <span style="color: #d1f1a9;">class</span> <span style="color: #bbdaff;">FlatMap</span>[<span style="color: #bbdaff;">S</span>[+<span style="color: #d1f1a9;">_</span>], <span style="color: #bbdaff;">A</span>, +<span style="color: #bbdaff;">B</span>](
    a<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">Free</span>[<span style="color: #bbdaff;">S</span>, <span style="color: #bbdaff;">A</span>],
    f<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">A</span> <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">Free</span>[<span style="color: #bbdaff;">S</span>, <span style="color: #bbdaff;">B</span>]) <span style="color: #d1f1a9;">extends</span> <span style="color: #bbdaff;">Free</span>[<span style="color: #bbdaff;">S</span>, <span style="color: #bbdaff;">B</span>]
}

<span style="color: #d1f1a9;">case</span> <span style="color: #d1f1a9;">class</span> <span style="color: #bbdaff;">Done</span>[<span style="color: #bbdaff;">S</span>[+<span style="color: #d1f1a9;">_</span>], +<span style="color: #bbdaff;">A</span>](a<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">A</span>) <span style="color: #d1f1a9;">extends</span> <span style="color: #bbdaff;">Free</span>[<span style="color: #bbdaff;">S</span>, <span style="color: #bbdaff;">A</span>]

<span style="color: #d1f1a9;">case</span> <span style="color: #d1f1a9;">class</span> <span style="color: #bbdaff;">More</span>[<span style="color: #bbdaff;">S</span>[+<span style="color: #d1f1a9;">_</span>], +<span style="color: #bbdaff;">A</span>](k<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">S</span>[<span style="color: #bbdaff;">Free</span>[<span style="color: #bbdaff;">S</span>, <span style="color: #bbdaff;">A</span>]]) <span style="color: #d1f1a9;">extends</span> <span style="color: #bbdaff;">Free</span>[<span style="color: #bbdaff;">S</span>, <span style="color: #bbdaff;">A</span>]
</pre>
</div>

<blockquote>
<p>
译者注: S 是 Function0 的推广. S 具有能够挂起计算的能力.
</p>
</blockquote>

<p>
那么, <code>Trampoline</code> 可以如下定义:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #d1f1a9;">type</span> <span style="color: #bbdaff;">Trampoline</span>[+<span style="color: #bbdaff;">A</span>] <span style="color: #d1f1a9;">=</span> <span style="color: #bbdaff;">Free</span>[<span style="color: #bbdaff;">Function0</span>, <span style="color: #bbdaff;">A</span>]
</pre>
</div>

<p>
就像 <code>Done</code> 和 <code>FlatMap</code> 数据构造器一样, <code>Free[S, A]</code> 是任意协变的 <code>Functor</code> S 的一种 Monad. 从范畴论角度来看, 它正是该 <code>Functor</code> 生成的 <code>Free Monad</code> [4].
S 必须是一个 <code>Functor</code> 即必须存在 Functor[S]<sup>3</sup>:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #d1f1a9;">trait</span> <span style="color: #bbdaff;">Functor</span>[<span style="color: #bbdaff;">F</span>[<span style="color: #d1f1a9;">_</span>]] {
  <span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">map</span>[<span style="color: #bbdaff;">A</span>, <span style="color: #bbdaff;">B</span>](m<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">F</span>[<span style="color: #bbdaff;">A</span>])(f<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">A</span> <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">B</span>)<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">F</span>[<span style="color: #bbdaff;">B</span>]
}
</pre>
</div>

<p>
对 <code>Function0</code> 来说是显而易见的:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #ebbbff;">implicit</span> <span style="color: #d1f1a9;">val</span> <span style="color: #ffeead;">f0Functor</span> <span style="color: #d1f1a9;">=</span> <span style="color: #d1f1a9;">new</span> <span style="color: #bbdaff;">Functor</span>[<span style="color: #bbdaff;">Function0</span>] {
  <span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">map</span>[<span style="color: #bbdaff;">A</span>, <span style="color: #bbdaff;">B</span>](a<span style="color: #d1f1a9;">:</span> () <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">A</span>)(f<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">A</span> <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">B</span>) <span style="color: #d1f1a9;">=</span> () <span style="color: #d1f1a9;">=&gt;</span> f(a())
}
</pre>
</div>
</div>

<div id="outline-container-org69f3e7d" class="outline-4">
<h4 id="org69f3e7d"><span class="section-number-4">3.8.1</span> Free Monad 的函数</h4>
<div class="outline-text-4" id="text-3-8-1">
<p>
为证实 Free Monad 的功效, 我们需要将之前为 <code>Trampoline</code> 定义的函数进行推广. 例如, 以下是 <code>resume</code> 的推广:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #ebbbff;">final</span> <span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">resume</span>(<span style="color: #ebbbff;">implicit</span> <span style="color: #bbdaff;">S</span><span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">Functor</span>[<span style="color: #bbdaff;">S</span>])<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">Either</span>[<span style="color: #bbdaff;">S</span>[<span style="color: #bbdaff;">Free</span>[<span style="color: #bbdaff;">S</span>, <span style="color: #bbdaff;">A</span>]], <span style="color: #bbdaff;">A</span>] <span style="color: #d1f1a9;">=</span>
  <span style="color: #d1f1a9;">this</span> <span style="color: #d1f1a9;">match</span> {
    <span style="color: #d1f1a9;">case</span> <span style="color: #bbdaff;">Done</span>(<span style="color: #ffeead;">a</span>) <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">Right</span>(a)
    <span style="color: #d1f1a9;">case</span> <span style="color: #bbdaff;">More</span>(<span style="color: #ffeead;">k</span>) <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">Left</span>(k)
    <span style="color: #d1f1a9;">case</span> <span style="color: #ffeead;">a</span> <span style="color: #bbdaff;">FlatMap</span> <span style="color: #ffeead;">f</span> <span style="color: #d1f1a9;">=&gt;</span> a <span style="color: #d1f1a9;">match</span> {
      <span style="color: #d1f1a9;">case</span> <span style="color: #bbdaff;">Done</span>(<span style="color: #ffeead;">a</span>) <span style="color: #d1f1a9;">=&gt;</span> f(a).resume
      <span style="color: #d1f1a9;">case</span> <span style="color: #bbdaff;">More</span>(<span style="color: #ffeead;">k</span>) <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">Left</span>(<span style="color: #bbdaff;">S</span>.map(k)(<span style="color: #d1f1a9;">_</span> flatMap f))
      <span style="color: #d1f1a9;">case</span> <span style="color: #ffeead;">b</span> <span style="color: #bbdaff;">FlatMap</span> <span style="color: #ffeead;">g</span> <span style="color: #d1f1a9;">=&gt;</span> b.flatMap((x<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">Any</span>) <span style="color: #d1f1a9;">=&gt;</span> g(x) flatMap f).resume
    }
  }
</pre>
</div>

<p>
注意到该定义与之前 <code>Trampoline</code> 的 <code>resume</code> 如出一辙. 有所不同的只是类型签名, 隐式的 <code>Functor</code> 参数, 以及我们将显式的 <code>Function0</code> 构造改为了 <code>Functor</code> 的 <code>map</code> 方法调用. 这也适用于其它函数, 如 <code>zip</code>, <code>map</code>, 和 <code>flatMap</code> [10]. 以下是 <code>zip</code> 的定义:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">zip</span>[<span style="color: #bbdaff;">B</span>](b<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">Free</span>[<span style="color: #bbdaff;">S</span>, <span style="color: #bbdaff;">B</span>])(<span style="color: #ebbbff;">implicit</span> <span style="color: #bbdaff;">S</span><span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">Functor</span>[<span style="color: #bbdaff;">S</span>])<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">Free</span>[<span style="color: #bbdaff;">S</span>, (<span style="color: #bbdaff;">A</span>, <span style="color: #bbdaff;">B</span>)] <span style="color: #d1f1a9;">=</span>
  (<span style="color: #d1f1a9;">this</span>.resume, b.resume) <span style="color: #d1f1a9;">match</span> {
    <span style="color: #d1f1a9;">case</span> (<span style="color: #bbdaff;">Right</span>(<span style="color: #ffeead;">a</span>), <span style="color: #bbdaff;">Right</span>(<span style="color: #bbdaff;">B</span>)) <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">Done</span>((a, b))
    <span style="color: #d1f1a9;">case</span> (<span style="color: #bbdaff;">Left</span>(<span style="color: #ffeead;">a</span>), <span style="color: #bbdaff;">Left</span>(<span style="color: #ffeead;">b</span>)) <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">More</span>(<span style="color: #bbdaff;">S</span>.map(a)(x <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">More</span>(<span style="color: #bbdaff;">S</span>.map(b)(y <span style="color: #d1f1a9;">=&gt;</span> x zip y))))
    <span style="color: #d1f1a9;">case</span> (<span style="color: #bbdaff;">Left</span>(<span style="color: #ffeead;">a</span>), <span style="color: #bbdaff;">Right</span>(<span style="color: #ffeead;">b</span>)) <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">More</span>(<span style="color: #bbdaff;">S</span>.map(a)(x <span style="color: #d1f1a9;">=&gt;</span> x zip <span style="color: #bbdaff;">Done</span>(b))
    <span style="color: #d1f1a9;">case</span> (<span style="color: #bbdaff;">Right</span>(<span style="color: #ffeead;">a</span>), <span style="color: #bbdaff;">Left</span>(<span style="color: #ffeead;">b</span>)) <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">More</span>(<span style="color: #bbdaff;">S</span>.map(b)(y <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">Done</span>(a) zip y)
  }
</pre>
</div>
</div>
</div>
