_org/2016-12-11-Translate_Stackless_Scala_With_Free_Monads.org
*** 普通数据类型到 Free Monad

粗略的来看, 我们可以将 ~Free[S, A]~ 看作事任何以某种 ~Functor~ S 作为分支节点并以某种数据类型 A 作为叶子节点的计算. 为证明这一点, 考虑一个普通的决策树. 它是一个 =Free Monad=, 其 ~Functor~ 将每个分支节点的计算分为两部分:

#+BEGIN_SRC scala
  type Pair[+A] = (A, A)
  type BinTree[+A] = Free[Pair, A]
#+END_SRC

~BinTree[A]~ 的 ~Done~ 的情况指的是包含一个类型为 A 的值的叶子节点. 其 ~More~ 则是一个包含两个类型为 ~BinTree[A]~ 的分支节点. 我们的 =Free Monad= (即 FlatMap 的情况) 就是对任意的节点, 给予一个树生成算法, 再将生成的树替换原有节点. 由于它是 ~Free~ 的实例, 因此 ~Trampline~ 的特性使得我们可以在恒定的时间和栈空间进行操作.

为了得到一棵能够给定任意分支数量的树, 我们可以使用 ~List~ Functor:

#+BEGIN_SRC scala
  type Tree[+A] = Free[List, A]
#+END_SRC

事实上, ~List~ 本身就可以表示为 ~Free~ _^{4} 的应用:

#+BEGIN_SRC scala
type List[A] = Free[({type λ[+α] = (A, α)}#λ), Unit]
#+END_SRC

在这种表示中, 一个 ~List[A]~ 是一个协同程序, 它每次 ~resume~ 可以产生一个类型为 A 的值, 而 =Unit= 则表示当前为空. 这里的 ~bind~ 并不是真正 ~List~ 的 ~flatMap~ (也就是由一个新生成 =List= 替代每个当前元素), 而是将两个 =List= 首尾相连^{5}. 同样, 由于是 ~Free~ 的实例, 操作均在恒定的时间和栈空间中.

这里所给的 ~List~ 的类型参数是一个逆变的, 但可以改为协变. 这可以作为一个小练习.

*** 一个 Free 的 State Monad

尽管本文所举的 =Free Monad= 的例子非常简单, 用来挂起的 =Functor= 可以是非常复杂的. 它可以以任意的组合方式来输出或等待输入. 我们可以把 ~State~ 作为一种小型语言, 这是状态的 ~set~ 和 ~put~ 定义:

#+BEGIN_SRC scala
  sealed trait StateF[S, +A]
  case class Get[S, A](f: S => A) extends StateF[S, A]
  case class Put[S, A](s: S, a: A) extends StateF[S, A]
#+END_SRC

在 ~Get~ 的构造器中, ~f~ 是一个接收当前状态值的函数. 而在 ~Put~ 构造器中, ~s~ 是一个新的状态, a 是计算的剩余部分 (可能用来对状态做一些事情).

我们要指明当前的数据类型是一个 ~Functor~:

#+BEGIN_SRC scala
  implicit def statefFun[S] = new Functor[({type λ[+α] = StateF[S, α)})#λ] {
    def map[A, B](m: StateF[S, A])(f: A => B) = m match {
      case Get(g) => Get((s: S) => f(g(s)))
      case Put(s, a) => Put(s, f(a))
    }
  }
#+END_SRC

我们可以直接用 ~StateF~ ~Functor~ 来生成一个类 ~State~ 的 ~Monad~:

#+BEGIN_SRC scala
  type FreeState[S, +A] = Free[({type λ[+α] = StateF[S, α)})#λ, A]
#+END_SRC

第一部分的 ~pureState~ 组合子可以由 =Free Monad= 的 ~Done~ 构造器生成:

#+BEGIN_SRC scala
  def pureState[S, A](a: A): FreeState[S, A] = Done(a)
#+END_SRC

另外的获取和设置状态的方法也可以简单定义:

#+BEGIN_SRC scala
  def getState[S]: FreeState[S, S] = More(Get(s => Done(s)))

  def setState[S](s: S): FreeState[S, Unit] = More(Put(s, Done()))
#+END_SRC

执行一个 =State= 只需一个简单的循环:

#+BEGIN_SRC scala
  def evalS[S, A](s: S, t: FreeState[S, A]): A = t.resume match {
    case Left(Get(f)) => evalS(s, f(s))
    case Left(Put(n, a)) => evalS(n, a)
    case Right(a) => a
  }
#+END_SRC

现在我们可以在该 ~Monad~ 中写纯函数了. 比如, 一下是第一部分的 ~zipIndex~, 这次我们用 ~FreeState~ 的 ~Monda~:

#+BEGIN_SRC scala
  def zipIndex[A](as: List[A]): List[(Int, A)] = evalS(0, as.foldLeft(
    pureState[Int, List[(Int, A)]](List())) {
    (acc, a) => for {
      rs <- acc
      n <- getState
      _ <- setState(n + 1)
    } yield (n,a)::xs }).reverse
#+END_SRC

实现的方式几乎是一致的, 同时在不使用 ~Trampoline~ 的情况下使用恒定的栈空间. 这里的结论是不需要总使用 ~trampoline~ 来封装数据类型. 可以使用新的 ~Free Monad~ 来实现同样的目的.

** 其它

#+BEGIN_QUOTE
后续部分是作者对当前工作的总结和展望.
#+END_QUOTE
