_posts/2016-12-11-Translate_Stackless_Scala_With_Free_Monads.org.html

<div id="outline-container-org7656f91" class="outline-4">
<h4 id="org7656f91"><span class="section-number-4">3.8.2</span> 普通数据类型到 Free Monad</h4>
<div class="outline-text-4" id="text-3-8-2">
<p>
粗略的来看, 我们可以将 <code>Free[S, A]</code> 看作事任何以某种 <code>Functor</code> S 作为分支节点并以某种数据类型 A 作为叶子节点的计算. 为证明这一点, 考虑一个普通的决策树. 它是一个 <code>Free Monad</code>, 其 <code>Functor</code> 将每个分支节点的计算分为两部分:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #d1f1a9;">type</span> <span style="color: #bbdaff;">Pair</span>[+<span style="color: #bbdaff;">A</span>] <span style="color: #d1f1a9;">=</span> (<span style="color: #bbdaff;">A</span>, <span style="color: #bbdaff;">A</span>)
<span style="color: #d1f1a9;">type</span> <span style="color: #bbdaff;">BinTree</span>[+<span style="color: #bbdaff;">A</span>] <span style="color: #d1f1a9;">=</span> <span style="color: #bbdaff;">Free</span>[<span style="color: #bbdaff;">Pair</span>, <span style="color: #bbdaff;">A</span>]
</pre>
</div>

<p>
<code>BinTree[A]</code> 的 <code>Done</code> 的情况指的是包含一个类型为 A 的值的叶子节点. 其 <code>More</code> 则是一个包含两个类型为 <code>BinTree[A]</code> 的分支节点. 我们的 <code>Free Monad</code> (即 FlatMap 的情况) 就是对任意的节点, 给予一个树生成算法, 再将生成的树替换原有节点. 由于它是 <code>Free</code> 的实例, 因此 <code>Trampline</code> 的特性使得我们可以在恒定的时间和栈空间进行操作.
</p>

<p>
为了得到一棵能够给定任意分支数量的树, 我们可以使用 <code>List</code> Functor:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #d1f1a9;">type</span> <span style="color: #bbdaff;">Tree</span>[+<span style="color: #bbdaff;">A</span>] <span style="color: #d1f1a9;">=</span> <span style="color: #bbdaff;">Free</span>[<span style="color: #bbdaff;">List</span>, <span style="color: #bbdaff;">A</span>]
</pre>
</div>

<p>
事实上, <code>List</code> 本身就可以表示为 <code>Free</code> _<sup>4</sup> 的应用:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #d1f1a9;">type</span> <span style="color: #bbdaff;">List</span>[<span style="color: #bbdaff;">A</span>] <span style="color: #d1f1a9;">=</span> <span style="color: #bbdaff;">Free</span>[({<span style="color: #d1f1a9;">type</span> &#955;[+&#945;] <span style="color: #d1f1a9;">=</span> (<span style="color: #bbdaff;">A</span>, &#945;)}<span style="color: #d1f1a9;">#</span>&#955;), <span style="color: #bbdaff;">Unit</span>]
</pre>
</div>

<p>
在这种表示中, 一个 <code>List[A]</code> 是一个协同程序, 它每次 <code>resume</code> 可以产生一个类型为 A 的值, 而 <code>Unit</code> 则表示当前为空. 这里的 <code>bind</code> 并不是真正 <code>List</code> 的 <code>flatMap</code> (也就是由一个新生成 <code>List</code> 替代每个当前元素), 而是将两个 <code>List</code> 首尾相连<sup>5</sup>. 同样, 由于是 <code>Free</code> 的实例, 操作均在恒定的时间和栈空间中.
</p>

<p>
这里所给的 <code>List</code> 的类型参数是一个逆变的, 但可以改为协变. 这可以作为一个小练习.
</p>
</div>
</div>

<div id="outline-container-org188a5d4" class="outline-4">
<h4 id="org188a5d4"><span class="section-number-4">3.8.3</span> 一个 Free 的 State Monad</h4>
<div class="outline-text-4" id="text-3-8-3">
<p>
尽管本文所举的 <code>Free Monad</code> 的例子非常简单, 用来挂起的 <code>Functor</code> 可以是非常复杂的. 它可以以任意的组合方式来输出或等待输入. 我们可以把 <code>State</code> 作为一种小型语言, 这是状态的 <code>set</code> 和 <code>put</code> 定义:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #ebbbff;">sealed</span> <span style="color: #d1f1a9;">trait</span> <span style="color: #bbdaff;">StateF</span>[<span style="color: #bbdaff;">S</span>, +<span style="color: #bbdaff;">A</span>]
<span style="color: #d1f1a9;">case</span> <span style="color: #d1f1a9;">class</span> <span style="color: #bbdaff;">Get</span>[<span style="color: #bbdaff;">S</span>, <span style="color: #bbdaff;">A</span>](f<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">S</span> <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">A</span>) <span style="color: #d1f1a9;">extends</span> <span style="color: #bbdaff;">StateF</span>[<span style="color: #bbdaff;">S</span>, <span style="color: #bbdaff;">A</span>]
<span style="color: #d1f1a9;">case</span> <span style="color: #d1f1a9;">class</span> <span style="color: #bbdaff;">Put</span>[<span style="color: #bbdaff;">S</span>, <span style="color: #bbdaff;">A</span>](s<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">S</span>, a<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">A</span>) <span style="color: #d1f1a9;">extends</span> <span style="color: #bbdaff;">StateF</span>[<span style="color: #bbdaff;">S</span>, <span style="color: #bbdaff;">A</span>]
</pre>
</div>

<p>
在 <code>Get</code> 的构造器中, <code>f</code> 是一个接收当前状态值的函数. 而在 <code>Put</code> 构造器中, <code>s</code> 是一个新的状态, a 是计算的剩余部分 (可能用来对状态做一些事情).
</p>

<p>
我们要指明当前的数据类型是一个 <code>Functor</code>:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #ebbbff;">implicit</span> <span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">statefFun</span>[<span style="color: #bbdaff;">S</span>] <span style="color: #d1f1a9;">=</span> <span style="color: #d1f1a9;">new</span> <span style="color: #bbdaff;">Functor</span>[({<span style="color: #d1f1a9;">type</span> &#955;[+&#945;] <span style="color: #d1f1a9;">=</span> <span style="color: #bbdaff;">StateF</span>[<span style="color: #bbdaff;">S</span>, &#945;)})<span style="color: #d1f1a9;">#</span>&#955;] {
  <span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">map</span>[<span style="color: #bbdaff;">A</span>, <span style="color: #bbdaff;">B</span>](m<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">StateF</span>[<span style="color: #bbdaff;">S</span>, <span style="color: #bbdaff;">A</span>])(f<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">A</span> <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">B</span>) <span style="color: #d1f1a9;">=</span> m <span style="color: #d1f1a9;">match</span> {
    <span style="color: #d1f1a9;">case</span> <span style="color: #bbdaff;">Get</span>(<span style="color: #ffeead;">g</span>) <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">Get</span>((s<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">S</span>) <span style="color: #d1f1a9;">=&gt;</span> f(g(s)))
    <span style="color: #d1f1a9;">case</span> <span style="color: #bbdaff;">Put</span>(<span style="color: #ffeead;">s</span>, <span style="color: #ffeead;">a</span>) <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">Put</span>(s, f(a))
  }
}
</pre>
</div>

<p>
我们可以直接用 <code>StateF</code> <code>Functor</code> 来生成一个类 <code>State</code> 的 <code>Monad</code>:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #d1f1a9;">type</span> <span style="color: #bbdaff;">FreeState</span>[<span style="color: #bbdaff;">S</span>, +<span style="color: #bbdaff;">A</span>] <span style="color: #d1f1a9;">=</span> <span style="color: #bbdaff;">Free</span>[({<span style="color: #d1f1a9;">type</span> &#955;[+&#945;] <span style="color: #d1f1a9;">=</span> <span style="color: #bbdaff;">StateF</span>[<span style="color: #bbdaff;">S</span>, &#945;)})<span style="color: #d1f1a9;">#</span>&#955;, <span style="color: #bbdaff;">A</span>]
</pre>
</div>

<p>
第一部分的 <code>pureState</code> 组合子可以由 <code>Free Monad</code> 的 <code>Done</code> 构造器生成:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">pureState</span>[<span style="color: #bbdaff;">S</span>, <span style="color: #bbdaff;">A</span>](a<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">A</span>)<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">FreeState</span>[<span style="color: #bbdaff;">S</span>, <span style="color: #bbdaff;">A</span>] <span style="color: #d1f1a9;">=</span> <span style="color: #bbdaff;">Done</span>(a)
</pre>
</div>

<p>
另外的获取和设置状态的方法也可以简单定义:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">getState</span>[<span style="color: #bbdaff;">S</span>]<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">FreeState</span>[<span style="color: #bbdaff;">S</span>, <span style="color: #bbdaff;">S</span>] <span style="color: #d1f1a9;">=</span> <span style="color: #bbdaff;">More</span>(<span style="color: #bbdaff;">Get</span>(s <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #bbdaff;">Done</span>(s)))

<span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">setState</span>[<span style="color: #bbdaff;">S</span>](s<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">S</span>)<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">FreeState</span>[<span style="color: #bbdaff;">S</span>, <span style="color: #bbdaff;">Unit</span>] <span style="color: #d1f1a9;">=</span> <span style="color: #bbdaff;">More</span>(<span style="color: #bbdaff;">Put</span>(s, <span style="color: #bbdaff;">Done</span>()))
</pre>
</div>

<p>
执行一个 <code>State</code> 只需一个简单的循环:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">evalS</span>[<span style="color: #bbdaff;">S</span>, <span style="color: #bbdaff;">A</span>](s<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">S</span>, t<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">FreeState</span>[<span style="color: #bbdaff;">S</span>, <span style="color: #bbdaff;">A</span>])<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">A</span> <span style="color: #d1f1a9;">=</span> t.resume <span style="color: #d1f1a9;">match</span> {
  <span style="color: #d1f1a9;">case</span> <span style="color: #bbdaff;">Left</span>(<span style="color: #bbdaff;">Get</span>(<span style="color: #ffeead;">f</span>)) <span style="color: #d1f1a9;">=&gt;</span> evalS(s, f(s))
  <span style="color: #d1f1a9;">case</span> <span style="color: #bbdaff;">Left</span>(<span style="color: #bbdaff;">Put</span>(<span style="color: #ffeead;">n</span>, <span style="color: #ffeead;">a</span>)) <span style="color: #d1f1a9;">=&gt;</span> evalS(n, a)
  <span style="color: #d1f1a9;">case</span> <span style="color: #bbdaff;">Right</span>(<span style="color: #ffeead;">a</span>) <span style="color: #d1f1a9;">=&gt;</span> a
}
</pre>
</div>

<p>
现在我们可以在该 <code>Monad</code> 中写纯函数了. 比如, 一下是第一部分的 <code>zipIndex</code>, 这次我们用 <code>FreeState</code> 的 <code>Monda</code>:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">zipIndex</span>[<span style="color: #bbdaff;">A</span>](as<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">List</span>[<span style="color: #bbdaff;">A</span>])<span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">List</span>[(<span style="color: #bbdaff;">Int</span>, <span style="color: #bbdaff;">A</span>)] <span style="color: #d1f1a9;">=</span> evalS(<span style="color: #bbdaff;">0</span>, as.foldLeft(
  pureState[<span style="color: #bbdaff;">Int</span>, <span style="color: #bbdaff;">List</span>[(<span style="color: #bbdaff;">Int</span>, <span style="color: #bbdaff;">A</span>)]](<span style="color: #bbdaff;">List</span>())) {
  (acc, a) <span style="color: #d1f1a9;">=&gt;</span> <span style="color: #d1f1a9;">for</span> {
    rs <span style="color: #d1f1a9;">&lt;-</span> acc
    n <span style="color: #d1f1a9;">&lt;-</span> getState
    <span style="color: #d1f1a9;">_</span> <span style="color: #d1f1a9;">&lt;-</span> setState(n + <span style="color: #bbdaff;">1</span>)
  } <span style="color: #d1f1a9;">yield</span> (n,a)::xs }).reverse
</pre>
</div>

<p>
实现的方式几乎是一致的, 同时在不使用 <code>Trampoline</code> 的情况下使用恒定的栈空间. 这里的结论是不需要总使用 <code>trampoline</code> 来封装数据类型. 可以使用新的 <code>Free Monad</code> 来实现同样的目的.
</p>
</div>
</div>
</div>

<div id="outline-container-orga74331f" class="outline-3">
<h3 id="orga74331f"><span class="section-number-3">3.9</span> 其它</h3>
<div class="outline-text-3" id="text-3-9">
<blockquote>
<p>
后续部分是作者对当前工作的总结和展望.
</p>
</blockquote>
</div>
</div>
</div>
